// 날짜 : 2022/10/06
// 문제 : 정수 사각형 차이의 최소 2
// n×n 크기의 격자 정보가 주어졌을 때, (1, 1)에서 시작하여 오른쪽 혹은 밑으로만 이동하여 (n, n)으로 간다고 했을 때
// 거쳐간 위치에 적혀있는 수들 중 |최댓값-최솟값|을 최소로 만드는 프로그램을 작성해보세요.

// 입력 형식 :
// 첫 번째 줄에는 n이 주어집니다.
// 두 번째 줄부터 n개의 줄에 걸쳐 각 행에 해당하는 n개의 정수 값이 공백을 사이에 두고 주어집니다.
// 1 ≤ n ≤ 100
// 1 ≤ 주어지는 숫자 ≤ 100

// 입력 예시 01 :
// 3
// 1 2 3
// 5 4 6
// 7 1 2

// 출력 예시 01 :
// 3


// 입력 예시 02 :
// 4
// 20 30 51 30
// 22 10 12 1
// 10 25 35 21
// 34 36 20 20

// 출력 예시 02 :
// 21

package DynamicProgramming01_동적계획법01;

public class DP12_해결필요 {
}
